app/controllers/users_controller.rb

INSERT INTO "users" ("address1", "address2", "city", "created_at", "crypted_password", "email", "fname", "lname", "phone", "salt", "state", "updated_at", "username", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save